# Дни недели смена сильных
Понедельник1 = 2
Вторник1 = 12
Среда1 = 21
Четверг1 = 30
Пятница1 = 40

# Дни недели смена слабых

Понедельник2 = 2
Вторник2 = 11
Среда2 = 19
Четверг2 = 27
Пятница2 = 36


# Настройка диапозонов таблицы

# 5 А Класс
ПолноеРасписание5А = 'Смена1!C3:D48'
Понедельник5А = 'Смена1!C3:D11'
Вторник5А = 'Смена1!C13:D20'
Среда5А = 'Смена1!C22:D29'
Четверг5А = 'Смена1!C31:D39'
Пятница5А = 'Смена1C41:D48'
Замены5А = 'Расписание замен 1 смены!C3:D10'

# 5 Б класс
ПолноеРасписание5Б = 'Смена1!E3:F48'
Понедельник5Б = 'Смена1!E3:F11'
Вторник5Б = 'Смена1!E13:F20'
Среда5Б = 'Смена1!E22:F29'
Четверг5Б = 'Смена1!E31:F39'
Пятница5Б = 'Смена1E41:F48'
Замены5Б = 'Расписание замен 1 смены!E3:F10'

# 5 В класс
ПолноеРасписание5В = 'Смена1!G3:H48'
Понедельник5В = 'Смена1!G3:H11'
Вторник5В = 'Смена1!G13:H20'
Среда5В = 'Смена1!G22:H29'
Четверг5В = 'Смена1!G31:H39'
Пятница5В = 'Смена1!G41:H48'
Замены5В = 'Расписание замен 1 смены!G3:H10'


# 5 Г класс
ПолноеРасписание5Г = 'Смена1!I3:J48'
Понедельник5Г = 'Смена1!I3:J11'
Вторник5Г = 'Смена1!I13:J20'
Среда5Г = 'Смена1!I22:J29'
Четверг5Г = 'Смена1!I31:J39'
Пятница5Г = 'Смена1!I41:J48'
Замены5Г = 'Расписание замен 1 смены!I3:J10'


# 5 Д класс
ПолноеРасписание5Д = 'Смена1!K3:L48'
Понедельник5Д = 'Смена1!K3:L11'
Вторник5Д = 'Смена1!K13:L20'
Среда5Д = 'Смена1!K22:L29'
Четверг5Д = 'Смена1!K31:L39'
Пятница5Д = 'Смена1!K41:L48'
Замены5Д = 'Расписание замен 1 смены!K3:L10'

# 6 А класс
ПолноеРасписание6А = 'Смена2!C3:D43'
Понедельник6А = 'Смена2!C3:D11'
Вторник6А = 'Смена2!C13:D20'
Среда6А = 'Смена2!C22:D29'
Четверг6А = 'Смена2!C31:D39'
Пятница6А = 'Смена2!C41:D48'
Замены6А = 'Расписание замен 2 смены!C3:D10'

# 6 Б класс
ПолноеРасписание6Б = 'Смена2!E3:F43'
Понедельник6Б = 'Смена2!E3:F11'
Вторник6Б = 'Смена2!E13:F20'
Среда6Б = 'Смена2!E22:F29'
Четверг6Б = 'Смена2!E31:F39'
Пятница6Б = 'Смена2!E41:F48'
Замены6Б = 'Расписание замен 2 смены!E3:F10'

# 6 В класс
ПолноеРасписание6В = 'Смена2!G3:H43'
Понедельник6В = 'Смена2!G3:H11'
Вторник6В = 'Смена2!G13:H20'
Среда6В = 'Смена2!G22:H29'
Четверг6В = 'Смена2!G31:H39'
Пятница6В = 'Смена2!G41:H48'
Замены6В = 'Расписание замен 2 смены!G3:H10'

# 6 Г класс
ПолноеРасписание6Г = 'Смена2!I3:J43'
Понедельник6Г = 'Смена2!I13:J20'
Вторник6Г = 'Смена2!I13:J20'
Среда6Г = 'Смена2!I22:J29'
Четверг6Г = 'Смена2!I31:J39'
Пятница6Г = 'Смена2!I41:J48'
Замены6Г = 'Расписание замен 2 смены!I3:J10'

# 7 А класс
ПолноеРасписание7А = 'Смена2!K3:L43'
Понедельник7А = 'Смена2!K3:L11'
Вторник7А = 'Смена2!K13:L20'
Среда7А = 'Смена2!K22:L29'
Четверг7А = 'Смена2!K31:L39'
Пятница7А = 'Смена2!K41:L48'
Замены7А = 'Расписание замен 2 смены!K3:L10'

# 7 Б класс
ПолноеРасписание7Б = 'Смена2!M3:N43'
Понедельник7Б = 'Смена2!M3:N11'
Вторник7Б = 'Смена2!M13:N20'
Среда7Б = 'Смена2!M22:N29'
Четверг7Б = 'Смена2!M31:N39'
Пятница7Б = 'Смена2!M41:N48'
Замены7Б = 'Расписание замен 2 смены!M3:N10'

# 7 В класс
ПолноеРасписание7В = 'Смена2!O3:P43'
Понедельник7В = 'Смена2!O3:P11'
Вторник7В = 'Смена2!O13:P20'
Среда7В = 'Смена2!O22:P29'
Четверг7В = 'Смена2!O31:P39'
Пятница7В = 'Смена2!O41:P48'
Замены7В = 'Расписание замен 2 смены!O3:P10'

# 7 Г класс
ПолноеРасписание7Г = 'Смена2!Q3:R43'
Понедельник7Г = 'Смена2!Q3:R11'
Вторник7Г = 'Смена2!Q13:R20'
Среда7Г = 'Смена2!Q22:R29'
Четверг7Г = 'Смена2!Q31:R39'
Пятница7Г = 'Смена2!Q41:R48'
Замены7Г = 'Расписание замен 2 смены!Q3:R10'

# 8 А класс
ПолноеРасписание8А = 'Смена2!S3:T43'
Понедельник8А = 'Смена2!S3:T11'
Вторник8А = 'Смена2!S13:T20'
Среда8А = 'Смена2!S22:T29'
Четверг8А = 'Смена2!S31:T39'
Пятница8А = 'Смена2!S41:T48'
Замены8А = 'Расписание замен 2 смены!S3:T10'

# 8 Б класс
ПолноеРасписание8Б = 'Смена2!U3:V43'
Понедельник8Б = 'Смена2!U3:V11'
Вторник8Б = 'Смена2!U13:V20'
Среда8Б = 'Смена2!U22:V29'
Четверг8Б = 'Смена2!U31:V39'
Пятница8Б = 'Смена2!U41:V48'
Замены8Б = 'Расписание замен 2 смены!U3:V10'

# 8 В класс
ПолноеРасписание8В = 'Смена2!W3:X43'
Понедельник8В = 'Смена2!W3:X11'
Вторник8В = 'Смена2!W13:X20'
Среда8В = 'Смена2!W22:X29'
Четверг8В = 'Смена2!W31:X39'
Пятница8В = 'Смена2!W41:X48'
Замены8В = 'Расписание замен 2 смены!W3:X10'

# 8 Г класс
ПолноеРасписание8Г = 'Смена2!Y3:Z43'
Понедельник8Г = 'Смена2!Y3:Z11'
Вторник8Г = 'Смена2!Y13:Z20'
Среда8Г = 'Смена2!Y22:Z29'
Четверг8Г = 'Смена2!Y31:Z39'
Пятница8Г = 'Смена2!Y41:Z48'
Замены8Г = 'Расписание замен 2 смены!Y3:Z10'

# 9 А класс
ПолноеРасписание9А = 'Смена1!M3:N48'
Понедельник9А = 'Смена1!M3:N11'
Вторник9А = 'Смена1!M13:N20'
Среда9А = 'Смена1!M22:N29'
Четверг9А = 'Смена1!M31:N39'
Пятница9А = 'Смена1!M41:N48'
Замены9А = 'Расписание замен 1 смены!M3:N10'

# 9 Б класс
ПолноеРасписание9Б = 'Смена1!O3:P48'
Понедельник9Б = 'Смена1!O3:P11'
Вторник9Б = 'Смена1!O13:P20'
Среда9Б = 'Смена1!O22:P29'
Четверг9Б = 'Смена1!O31:P39'
Пятница9Б = 'Смена1!O41:P48'
Замены9Б = 'Расписание замен 1 смены!O3:P10'

# 9 В класс
ПолноеРасписание9В = 'Смена1!Q3:R48'
Понедельник9В = 'Смена1!Q3:R11'
Вторник9В = 'Смена1!Q13:R20'
Среда9В = 'Смена1!Q22:R29'
Четверг9В = 'Смена1!Q31:R39'
Пятница9В = 'Смена1!Q41:R48'
Замены9В = 'Расписание замен 1 смены!Q3:R10'

# 9 Г класс
ПолноеРасписание9Г = 'Смена1!S3:T48'
Понедельник9Г = 'Смена1!S3:T11'
Вторник9Г = 'Смена1!S13:T20'
Среда9Г = 'Смена1!S22:T29'
Четверг9Г = 'Смена1!S31:T39'
Пятница9Г = 'Смена1!S41:T48'
Замены9Г = 'Расписание замен 1 смены!S3:T10'

# 10 А класс
ПолноеРасписание10А = 'Смена1!U3:V48'
Понедельник10А = 'Смена1!U3:V11'
Вторник10А = 'Смена1!U13:V20'
Среда10А = 'Смена1!U22:V29'
Четверг10А = 'Смена1!U31:V39'
Пятница10А = 'Смена1!U41:V48'
Замены10А = 'Расписание замен 1 смены!U3:V10'

# 10 Б класс
ПолноеРасписание10Б = 'Смена1!W3:X48'
Понедельник10Б = 'Смена1!W3:X11'
Вторник10Б = 'Смена1!W13:X20'
Среда10Б = 'Смена1!W22:X29'
Четверг10Б = 'Смена1!W31:X39'
Пятница10Б = 'Смена1!W41:X48'
Замены10Б = 'Расписание замен 1 смены!W3:X10'

# 11 А класс
ПолноеРасписание11А = 'Смена1!Y3:Z48'
Понедельник11А = 'Смена1!Y3:Z11'
Вторник11А = 'Смена1!Y13:Z20'
Среда11А = 'Смена1!Y22:Z29'
Четверг11А = 'Смена1!Y31:Z39'
Пятница11А = 'Смена1!Y41:Z48'
Замены11А = 'Расписание замен 1 смены!Y3:Z10'

# 11 Б класс
ПолноеРасписание11Б = 'Смена1!AA3:AB48'
Понедельник11Б = 'Смена1!AA3:AB11'
Вторник11Б = 'Смена1!AA13:AB20'
Среда11Б = 'Смена1!AA22:AB29'
Четверг11Б = 'Смена1!AA31:AB39'
Пятница11Б = 'Смена1!AA41:AB48'
Замены11Б = 'Расписание замен 1 смены!AA3:AB10'